[
  {
    "id": 1,
    "name": "Booki", 
    "tools": "HTML, CSS, Media queries", 
    "description": "Projet de ma formation, l'objectif était de créer la page principale d'un site de type 'Airbnb' en utilisant du HTML et du CSS basiques, en suivant les instructions et une maquette Figma. Le site devait offrir un affichage dynamique en fonction du type d'appareil utilisé (desktop/tablette/mobile).", 
    "cover": "https://i.ibb.co/MRHqCyh/5st.png",
    "images": ["https://i.ibb.co/s5hkMpn/1st.png", "https://i.ibb.co/L5JYZWs/2nd.png", "https://i.ibb.co/18wCsWz/3rd.png", "https://i.ibb.co/jJtMCJ6/4st.png", "https://i.ibb.co/MRHqCyh/5st.png", "https://i.ibb.co/MZkLN8M/6st.png"],
    "why": "Projet de formation" 
  },
  {
    "id": 2,
    "name": "Kasa",
    "tools": "React",
    "description": "Kasa est un site de location d'appartements visant à mettre en relation des propriétaires avec d'éventuels locataires. <br />Le but du projet était de s'initier à React, comprendre son fonctionnement, développer mes premiers composants, statiques ou dynamiques, et automatiser l'affichage des éléments (les cartes d'appartements et leur page de détails sont générées automatiquement en ajoutant simplement les informations liées à la location). <br /> <br /> J'ai aussi appris à faire des routes permettant de naviguer dans le site, ainsi qu'une route permettant de récupérer toutes les erreurs d'URL.",
    "cover": "https://i.ibb.co/nCJ1Sg6/Kasa1.png",
    "images": ["https://i.ibb.co/nCJ1Sg6/Kasa1.png", "https://i.ibb.co/kMzpPx4/Kasa2.png", "https://i.ibb.co/mvQN68S/Kasa3.png", "https://i.ibb.co/6syvMW9/Kasa4.png"],
    "why": "Projet de formation"
  },
  {
    "id": 3,
    "name": "Nina Carducchi",
    "tools": "Optimisation, Débogage, SEO",
    "description": "Un autre projet de ma formation consistant à déboguer, optimiser les performances et améliorer le référencement du site d'une cliente. J'ai également dû rédiger un rapport d'intervention, détaillant précisément les tâches effectuées, en les justifiant et en documentant les actions réalisées.",
    "cover": "https://i.ibb.co/rfch0Tp/codeSEO1.png",
    "images": ["https://i.ibb.co/rfch0Tp/codeSEO1.png", "https://i.ibb.co/8YxY4dv/codeSEO2.png", "https://i.ibb.co/fd5j8jQ/Nina-Score.png"],
    "why": "Projet de formation"
  }
]
